In [3]:
import pandas as pd
import numpy as np

In [4]:
arr = np.array([1,2,3,4,5,6,7,8,9])
series = pd.Series(arr)
series

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [6]:
a = {'a':10,'b':20,'c':30,'d':40}
s = pd.Series(a)
s

a    10
b    20
c    30
d    40
dtype: int64

In [19]:
s = pd.Series([1,2,3,4,5,6])
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [9]:
s = pd.Series([1,2,3,4,5,6],index=[10,20,30,40,50,60])
s

10    1
20    2
30    3
40    4
50    5
60    6
dtype: int64

In [17]:
s = pd.Series(1,index=['a','b','c','d'])
s

a    1
b    1
c    1
d    1
dtype: int64

In [22]:
s = pd.Series((1,2,3,4,5,6))
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [24]:
data = [10,20,30,40,50]
df = pd.DataFrame(data)
df

    0
0  10
1  20
2  30
3  40
4  50

In [28]:
data  = [{'a':10,'b':20,'c':30,'d':40},{'a':40,'b':80,'c':100}]
df = pd.DataFrame(data)
df

    a   b    c     d
0  10  20   30  40.0
1  40  80  100   NaN

In [35]:
data = {'ones':pd.Series([1,2],index = ['a','b']),
        'two':pd.Series([10,20,30], index = [1,2,3])}
df = pd.DataFrame(data)
df

   ones   two
a   1.0   NaN
b   2.0   NaN
1   NaN  10.0
2   NaN  20.0
3   NaN  30.0

In [36]:
data = {'ones':pd.Series([1,2],index = ['a','b']),
        'two':pd.Series([10,20,30], index = ['a','b','c'])}
df = pd.DataFrame(data)
df

   ones  two
a   1.0   10
b   2.0   20
c   NaN   30

In [48]:
a =pd.read_excel("E:/New folder/Book1.xlsx")
a

,date,Papa,sunil,Stiffened,debit,fees,expenses,net,Cum.,Unnamed: 9
0,2021-09-14,0.0,12000.0,NaN,NaN,NaN,NaN,12000,12000,NaN
1,2021-09-30,NaN,NaN,12400.0,NaN,NaN,NaN,12400,24400,NaN
2,2021-10-09,10000.0,0.0,NaN,NaN,NaN,NaN,10000,34400,NaN
3,2021-10-16,0.0,12000.0,NaN,NaN,NaN,NaN,12000,46400,NaN
4,2021-10-18,0.0,0.0,NaN,10000.0,NaN,NaN,-10000,36400,NaN
5,2021-10-31,NaN,NaN,NaN,NaN,14000.0,3700.0,-17700,18700,NaN
6,2021-11-03,NaN,NaN,12400.0,NaN,NaN,NaN,12400,31100,NaN
7,2021-10-21,10000.0,NaN,NaN,NaN,NaN,NaN,10000,41100,NaN
8,2021-11-09,10000.0,NaN,NaN,NaN,NaN,NaN,10000,51100,NaN
9,2021-11-15,NaN,10000.0,NaN,NaN,NaN,NaN,10000,61100,NaN
10,2021-11-30,NaN,NaN,NaN,NaN,NaN,3000.0,-3000,58100,NaN
11,2021-12-01,NaN,NaN,12400.0,NaN,NaN,NaN,12400,70500,NaN
12,2021-12-15,NaN,10000.0,NaN,NaN,NaN,NaN,10000,80500,NaN
13,2021-12-23,NaN,NaN,NaN,NaN,NaN,4300.0,-4300,76200,Laptop repairing
14,2021-12-31,NaN,NaN,NaN,NaN,NaN,3000.0,-3000,73200,NaN
15,2021-12-27,NaN,NaN,NaN,NaN,43650.0,NaN,-43650,29550,NaN
16,2022-01-01,NaN,NaN,12400.0,NaN,NaN,NaN,12400,41950,NaN
17,2022-01-12,NaN,8000.0,NaN,NaN,NaN,NaN,8000,49950,NaN
18,2022-01-31,NaN,NaN,NaN,NaN,NaN,3000.0,-3000,46950,NaN
19,2022-02-01,NaN,NaN,12400.0,7000.0,NaN,NaN,5400,52350,NaN
20,2022-02-05,NaN,NaN,NaN,6000.0,NaN,3000.0,-9000,43350,Birthday Party
21,2022-02-27,10000.0,NaN,NaN,10000.0,NaN,NaN,0,43350,NaN
22,2022-02-28,NaN,NaN,NaN,NaN,NaN,3000.0,-3000,40350,NaN
23,2022-03-01,NaN,NaN,12400.0,NaN,NaN,3000.0,9400,49750,NaN
24,2022-03-10,5000.0,NaN,NaN,NaN,NaN,NaN,5000,54750,NaN
25,2022-03-16,NaN,NaN,NaN,NaN,NaN,966.0,-966,53784,Ticket
26,2022-03-20,5000.0,NaN,NaN,10000.0,NaN,NaN,-5000,48784,NaN
27,2022-03-20,NaN,NaN,NaN,NaN,NaN,1769.0,-1769,47015,Education Course
28,2022-03-21,NaN,NaN,NaN,NaN,NaN,400.0,-400,46615,Document Verification
29,2022-03-28,NaN,NaN,NaN,NaN,NaN,1029.0,-1029,45586,Clothes
30,2022-04-01,NaN,NaN,12400.0,NaN,NaN,NaN,12400,57986,NaN
31,2022-04-30,NaN,NaN,NaN,NaN,NaN,3000.0,-3000,54986,NaN
32,2022-04-09,NaN,15000.0,NaN,NaN,NaN,NaN,15000,69986,NaN
33,NaT,NaN,NaN,NaN,NaN,NaN,NaN,0,69986,NaN

In [43]:
df = pd.read_excel("C:/Users/HP/Desktop/Data.xlsx")
df

      ID  PlaceID  Rating  Service_rating
0      1      123     5.0               3
1      2      234     NaN               3
2      3      345     NaN               4
3      4      231     1.0               5
4   Dup1       56     3.0               4
5   Dup1        2     3.0               3
6   Dup1       76     4.0               3
7      5      998     5.0               3
8      6     2345     4.0               4
9      7      764     5.0               5
10     8       77     3.0           99999
11     8       77     3.0               4
12     8       77     3.0               4
13     8       77     3.0               4
14     8       77     3.0               4

In [45]:
b = pd.read_csv("E:\Dissertation\Catalogues\Catalogue yearwise.csv")
b

      Latitude  Longitude  year  month  DATE   Mw  DEPTH  Hour  Min  Sec
0      34.2000    77.5000  1917      5    18  6.0    0.0     3   15   50
1      34.2000    77.5000  1921     11    11  5.5    0.0     6   48   45
2      35.5000    77.0000  1923      1    10  5.5    0.0     4   40   15
3      35.3973    78.6790  1926      6     8  6.1   10.0    22   45   57
4      35.0000    78.0000  1926      7     8  5.5    0.0     2    6   30
...        ...        ...   ...    ...   ...  ...    ...   ...  ...  ...
1503   34.1913    78.0792  2021      7    20  4.2    0.0    23   27   37
1504   35.0938    79.9895  2021      7    21  4.1    0.0    21   54    4
1505   33.7975    78.0737  2021      7    21  4.3    0.0     4    1   45
1506   32.6792    75.4289  2021      8    18  4.4    0.0    23   38   30
1507   33.6198    76.3842  2021      9    13  4.6    0.0     3   46   45

[1508 rows x 10 columns]

In [49]:
b = pd.read_csv("E:\Dissertation\Catalogues\Catalogue yearwise.csv", header = None)
b

             0          1     2      3     4    5      6     7    8    9
0     Latitude  Longitude  year  month  DATE   Mw  DEPTH  Hour  Min  Sec
1         34.2       77.5  1917      5    18    6      0     3   15   50
2         34.2       77.5  1921     11    11  5.5      0     6   48   45
3         35.5         77  1923      1    10  5.5      0     4   40   15
4      35.3973     78.679  1926      6     8  6.1     10    22   45   57
...        ...        ...   ...    ...   ...  ...    ...   ...  ...  ...
1504   34.1913    78.0792  2021      7    20  4.2      0    23   27   37
1505   35.0938    79.9895  2021      7    21  4.1      0    21   54    4
1506   33.7975    78.0737  2021      7    21  4.3      0     4    1   45
1507   32.6792    75.4289  2021      8    18  4.4      0    23   38   30
1508   33.6198    76.3842  2021      9    13  4.6      0     3   46   45

[1509 rows x 10 columns]

In [52]:
Temp = pd.DataFrame({'Week1':pd.Series([12,23,34,45,56]),'Week2':pd.Series([14,24,16,12,32]),'Week3':pd.Series([10,21,23,20,30])})
Temp

   Week1  Week2  Week3
0     12     14     10
1     23     24     21
2     34     16     23
3     45     12     20
4     56     32     30

In [53]:
Temp.to_csv("Temp.csv")

In [55]:
Temp.to_excel("Temp.xlsx")

In [1]:
import pandas as pd

In [2]:
fruits = pd.Series([12,20,34], index = ['small', 'medium', 'large'])
fruits

small     12
medium    20
large     34
dtype: int64

In [4]:
fruits.values

array([12, 20, 34], dtype=int64)

In [5]:
fruits.size

3

In [6]:
fruits.item

<bound method IndexOpsMixin.item of small     12
medium    20
large     34
dtype: int64>

In [7]:
fruits.shape

(3,)

In [10]:
x = [13,-5,7,19]
s = pd.Series(x)
s

0    13
1    -5
2     7
3    19
dtype: int64

In [12]:
import numpy as np
arr = np.array([23,3.0,7,11])
s =pd.Series(arr, index = ['a','b','c','d'])
s

a    23.0
b     3.0
c     7.0
d    11.0
dtype: float64

In [14]:
print(s.values)
print(s.index)

[23.  3.  7. 11.]
Index(['a', 'b', 'c', 'd'], dtype='object')

In [15]:
print(s[1])

3.0

In [16]:
print(s[0:3])

a    23.0
b     3.0
c     7.0
dtype: float64

In [17]:
s['a'] = 13.5
s[2] = 23
print(s)

a    13.5
b     3.0
c    23.0
d    11.0
dtype: float64

In [20]:
S1 = pd.Series(['Amit',"Bob",'A','b','np.nan','Car','dog','cat'])
S1

0      Amit
1       Bob
2         A
3         b
4    np.nan
5       Car
6       dog
7       cat
dtype: object

In [23]:
print(S1.str.lower())

0      amit
1       bob
2         a
3         b
4    np.nan
5       car
6       dog
7       cat
dtype: object

In [24]:
print(S1.str.upper())

0      AMIT
1       BOB
2         A
3         B
4    NP.NAN
5       CAR
6       DOG
7       CAT
dtype: object

In [25]:
print(len(S1))

8

In [27]:
print(S1.str.len())

0    4
1    3
2    1
3    1
4    6
5    3
6    3
7    3
dtype: int64

In [31]:
s2 = pd.Index([' Arya ',' John ',' jack ','Sam '])
s2

Index([' Arya ', ' John ', ' jack ', 'Sam '], dtype='object')

In [32]:
print(s2.str.strip())

Index(['Arya', 'John', 'jack', 'Sam'], dtype='object')

In [33]:
print(s2.str.lstrip())

Index(['Arya ', 'John ', 'jack ', 'Sam '], dtype='object')

In [34]:
print(s2.str.rstrip())

Index([' Arya', ' John', ' jack', 'Sam'], dtype='object')

In [2]:

import pandas as pd
import numpy as np
arr = np.array([[1002,300,1220,3000],[4521,4560,4569,4752],[5423,5461,5412,5623],[6541,6321,6478,6895]])
q_result = pd.DataFrame(arr,index = ['Equity1','Equity2','Equity3','Equity4'], columns = ['Q1','Q2','Q3','Q4'])
q_result

           Q1    Q2    Q3    Q4
Equity1  1002   300  1220  3000
Equity2  4521  4560  4569  4752
Equity3  5423  5461  5412  5623
Equity4  6541  6321  6478  6895

In [3]:
q_result['Annual_result'] = q_result['Q1'] + q_result['Q2'] + q_result['Q3'] + q_result['Q4']
print(q_result)

           Q1    Q2    Q3    Q4  Annual_result
Equity1  1002   300  1220  3000           5522
Equity2  4521  4560  4569  4752          18402
Equity3  5423  5461  5412  5623          21919
Equity4  6541  6321  6478  6895          26235

In [4]:
q_result.drop(q_result.index[0:2])

           Q1    Q2    Q3    Q4  Annual_result
Equity3  5423  5461  5412  5623          21919
Equity4  6541  6321  6478  6895          26235

In [5]:
q_result.drop(['Annual_result'], axis = 'columns')

           Q1    Q2    Q3    Q4
Equity1  1002   300  1220  3000
Equity2  4521  4560  4569  4752
Equity3  5423  5461  5412  5623
Equity4  6541  6321  6478  6895

In [11]:

q_result._set_value('Equity2','Q2',50000)

In [8]:
arr1 = np.array([['Jude',1],['Madan',1],['Mohan',1],['suresh',1]])
arr2 = np.array([1001,1002,1003,1004])
costomer = pd.DataFrame(arr1, index = ['C1','C2','C3','C4'],columns = ['Name','Account_No.'])
account = pd.DataFrame(arr2, index = ['C1','C2','C3','C4'], columns = ['Account_n0.'])
print(costomer)
print(account)

      Name Account_No.
C1    Jude           1
C2   Madan           1
C3   Mohan           1
C4  suresh           1
    Account_n0.
C1         1001
C2         1002
C3         1003
C4         1004

In [10]:
costomer.update(account)